cool/tutorials/incompressible/pisoFoam/les/pitzDailyDirectMapped/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM Extend Project: Open Source CFD        |
|  \\    /   O peration     | Version:  1.6-ext                               |
|   \\  /    A nd           | Web:      www.extend-project.de                 |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
inlet
{
    type            directMappedPatch;
    nFaces          30;
    startFace       27238;
    sampleMode      nearestCell;
    sampleRegion    region0;
    samplePatch     none;
    offset          ( 0.0495 0 0 );
}

outlet
{
    type            patch;
    nFaces          57;
    startFace       27268;
}

upperWall
{
    type            wall;
    nFaces          275;
    startFace       27325;
}

lowerWall
{
    type            wall;
    nFaces          302;
    startFace       27600;
}

frontAndBack
{
    type            empty;
    nFaces          27570;
    startFace       27902;
}

)

// ************************************************************************* //
