cool/tutorials/incompressible/pisoFoam/les/pitzDailyDirectMapped/Allrun
#!/bin/sh
# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

# Get application name
application=`getApplication`

runApplication blockMesh
runApplication changeDictionary
runApplication $application
